# InvalidSpareSpace Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..InvalidSpareSpace Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
The number of poles for a spare/space in a single phase, [wire] wires panel cannot exceed [value].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidSpareSpace { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidSpareSpace As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidSpareSpace {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace